In [1]:
import sqlite3

Adding data on table

In [2]:
db=sqlite3.connect("D:/KN E D/DS/MySQLite_DataBase/Sports_database.db")

In [3]:
cur=db.cursor()

Constraints----
Unique-enter only unique values, no duplicate values
Not null---no blank values can be insrted in table

In [4]:
cur.execute("create table sport (id int primary key,sportsname text unique,dateofevent date,country text not null)")

In [5]:
cur.execute("insert into sport values(1,'cricket','2021-11-9','England')")

#this line will throw error as sportsname is duplicate --- unique constraint failed
#cur.execute("insert into sport values(2,'cricket','2018-08-02','Srilanka')")

In [6]:
cur.execute("insert into sport values(2,'Tennis','2018-08-02','Srilanka')")
print(cur.rowcount,"record(s) inserted")

1 record(s) inserted

In [7]:
results=cur.execute('select * from sport')

results.fetchall()

[(1, 'cricket', '2021-11-9', 'England'),
 (2, 'Tennis', '2018-08-02', 'Srilanka')]

#this query throe error: not null constraints : can not leave any field blank
#cur.executed("insert into values(3,'football','2022-05-30', NULL)")

In [8]:
results=cur.execute("insert into sport values(3,'Football','2022-05-30','Australia')")
db.commit;

In [9]:
results=cur.execute('select * from sport')

results.fetchall()

[(1, 'cricket', '2021-11-9', 'England'),
 (2, 'Tennis', '2018-08-02', 'Srilanka'),
 (3, 'Football', '2022-05-30', 'Australia')]

Employee database with DB and Python programmatically

Knowledge purpose only

In [11]:
import sqlite3

In [12]:
con=sqlite3.connect("D:/KN E D/DS/MySQLite_DataBase/emp_database.db")

In [13]:
def sql_table(con):
    cur=con.cursor()
    cur.execute("create table employee(id integer primary key,name text,salary real,department text,position text,hiredate date)")
    con.commit()

In [14]:
cur=con.cursor()

In [15]:
#calling function

sql_table(con)

In [16]:
cur=con.cursor()
cur.execute("insert into employee values(1,'Jack',9000,'HR','Manger','2019-07-09')")

In [17]:
con.commit;

In [19]:
results=cur.execute("select * from employee")
results.fetchall()

[(1, 'Jack', 9000.0, 'HR', 'Manger', '2019-07-09')]

In [14]:
cur=con.cursor()
cur.execute("insert into employee values(1,'Jack',9000,'HR','Manger','2019-07-09')")

In [15]:
con.commit;

In [16]:
results=cur.execute("select * from employee")
results.fetchall()

[(1, 'Jack', 9000.0, 'HR', 'Manger', '2019-07-09')]

results=cur.execute("select * from employee")
results.fetchall()

we can also pass values/arguments to an INSERT statment in the exceute() method.we can use the question mark (?) as a placeholder for each values. the syntex of the INSERT will be like the following:

cur.execute('''insert into employee(id,name,salary,department,position,hiredate) values(?,?,?,?,?,?)'''),entries)
entries=(2,'John',4000,'IT','Engineer','2018-02-06')

In [17]:
def sql_insert(con,entities):
    cur=con.cursor()
    cur.execute('insert into employee(id,name,salary,department,position,hiredate)values(?,?,?,?,?,?)',entities)

In [18]:
entities=(2,'Andrew',7000,'IT','Engineer','2015-04-06')

In [19]:
# Calling sql insert to insert the data

sql_insert(con,entities)

In [21]:
entities=(3,'Thomas',6000,'HR','Manager','2016-06-14')

In [23]:
sql_insert(con,entities)

In [24]:
results=cur.execute("select * from employee")
results.fetchall()

[(1, 'Jack', 9000.0, 'HR', 'Manger', '2019-07-09'),
 (2, 'Andrew', 7000.0, 'IT', 'Engineer', '2015-04-06'),
 (3, 'Thomas', 6000.0, 'HR', 'Manager', '2016-06-14')]

In [30]:
entities=(4,'Rudolf',8000,'IT','Engineer','2012-08-23')

In [31]:
sql_insert(con,entities)

IntegrityError: UNIQUE constraint failed: employee.id

In [32]:
results=cur.execute("select * from employee")
results.fetchall()

[(1, 'Jack', 9000.0, 'HR', 'Manger', '2019-07-09'),
 (2, 'Andrew', 7000.0, 'IT', 'Engineer', '2015-04-06'),
 (3, 'Thomas', 6000.0, 'HR', 'Manager', '2016-06-14'),
 (4, 'Rudolf', 8000.0, 'IT', 'Engineer', '2012-08-23')]

In [35]:
results=cur.execute("select * from employee")
results.fetchall()

[(1, 'Jack', 9000.0, 'HR', 'Manger', '2019-07-09'),
 (2, 'Andrew', 7000.0, 'IT', 'Engineer', '2015-04-06'),
 (3, 'Thomas', 6000.0, 'HR', 'Manager', '2016-06-14'),
 (4, 'Rudolf', 8000.0, 'IT', 'Engineer', '2012-08-23')]

In [36]:
def sql_update(con):
    cur=con.cursor()
    cur.execute('update employee set name="Martin" where id=1')
    con.commit()

In [37]:
sql_update(con)

In [38]:
results=cur.execute("select * from employee")
results.fetchall()

[(1, 'Martin', 9000.0, 'HR', 'Manger', '2019-07-09'),
 (2, 'Andrew', 7000.0, 'IT', 'Engineer', '2015-04-06'),
 (3, 'Thomas', 6000.0, 'HR', 'Manager', '2016-06-14'),
 (4, 'Rudolf', 8000.0, 'IT', 'Engineer', '2012-08-23')]

In [39]:
results=cur.execute("select id,name from employee")
results.fetchall()

[(1, 'Martin'), (2, 'Andrew'), (3, 'Thomas'), (4, 'Rudolf')]

In [40]:
entities=(5,'Thomas',6000,'HR','Manager','2017-06-14')

In [41]:
# Calling sql insert to insert the data

sql_insert(con,entities)

In [42]:
results=cur.execute("select * from employee")
results.fetchall()

[(1, 'Martin', 9000.0, 'HR', 'Manger', '2019-07-09'),
 (2, 'Andrew', 7000.0, 'IT', 'Engineer', '2015-04-06'),
 (3, 'Thomas', 6000.0, 'HR', 'Manager', '2016-06-14'),
 (4, 'Rudolf', 8000.0, 'IT', 'Engineer', '2012-08-23'),
 (5, 'Thomas', 6000.0, 'HR', 'Manager', '2017-06-14')]

In [43]:
results=cur.execute("select id,name from employee where salary>8000")
results.fetchall()

[(1, 'Martin')]

In [44]:
results=cur.execute("select id,name from employee where salary<8000")
results.fetchall()

[(2, 'Andrew'), (3, 'Thomas'), (5, 'Thomas')]

In [45]:
results=cur.execute("select id,name from employee where department in ('HR')")
results.fetchall()

[(1, 'Martin'), (3, 'Thomas'), (5, 'Thomas')]

In [46]:
results=cur.execute("select min(salary) from employee")
results.fetchall()

[(6000.0,)]

In [47]:
results=cur.execute("select max(salary) from employee")
results.fetchall()

[(9000.0,)]

In [48]:
results=cur.execute("select count(id) from employee")
results.fetchall()

[(5,)]

In [49]:
results=cur.execute("select distint(department) from employee")
results.fetchall()

OperationalError: no such function: distint

In [50]:
results=cur.execute("select distinct(department) from employee")
results.fetchall()

[('HR',), ('IT',)]

Distinct is the different

In [51]:
results=cur.execute("select count(distinct(department)) from employee")
results.fetchall()

[(2,)]

In [52]:
results=cur.execute("select sum(salary),position from employee")
results.fetchall()

[(36000.0, 'Manger')]

In [53]:
results=cur.execute("select sum(salary), department from employee group by department")
results.fetchall()

[(21000.0, 'HR'), (15000.0, 'IT')]